spec/dummy/app/controllers/tweets_controller.rb

  def index
    tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def show
    tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    tweet = Tweet.new(create_params.merge(author: current_user))

    p request.env['jsonapi_deserializable.reverse_mapping']

    unless tweet.save
---
INSERT INTO "tweets" ("author_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author_id", 1], ["content", "foo"], ["created_at", 2016-11-20 21:35:32 UTC], ["updated_at", 2016-11-20 21:35:32 UTC]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lucas"], ["email", "lucas@jsonapi-rb.org"], ["created_at", 2016-11-20 21:33:16 UTC], ["updated_at", 2016-11-20 21:33:16 UTC]]

  def destroy
    Tweet.delete(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]